---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeTypeOptions.IsValid
source: html/dcad1977-4433-d741-2c1c-214943ae37ee.htm
---
# Autodesk.Revit.DB.DirectShapeTypeOptions.IsValid Method

Determines whether a DirectShapeTypeOptions is internally consistent (valid).

## Syntax (C#)
```csharp
public bool IsValid()
```

## Remarks
This is currently a placeholder and always returns true. Will be made public_api and a validator when it does something useful.